export const statusWeights = {
  "需求调研": 0.1,
  "产品设计": 0.3,
  "产品开发": 1,
  "产品自测": 0.6,
  "UAT": 0.6,
  "部署上线": 0.3,
  "系统运维": 0.03,
  "项目暂停": 0,
};

export const roleWeights = {
  "项目经理": { "需求调研": 0.6, "产品设计": 0.7, "产品开发": 0.7, "产品自测": 0.7, "UAT": 0.7, "部署上线": 0.6, "系统运维": 0.2 },
  "产品经理": { "需求调研": 1, "产品设计": 1, "产品开发": 0.8, "产品自测": 0.6, "UAT": 0.6, "部署上线": 0.3, "系统运维": 0.2 },
  "技术负责人": { "需求调研": 0.5, "产品设计": 0.8, "产品开发": 0.9, "产品自测": 0.7, "UAT": 0.7, "部署上线": 0.6, "系统运维": 0.3 },
  "前端": { "需求调研": 0.1, "产品设计": 0.3, "产品开发": 1, "产品自测": 0.6, "UAT": 0.6, "部署上线": 0.3, "系统运维": 0.2 },
  "后端": { "需求调研": 0.1, "产品设计": 0.3, "产品开发": 1, "产品自测": 0.6, "UAT": 0.6, "部署上线": 0.3, "系统运维": 0.2 },
  "测试": { "需求调研": 0.1, "产品设计": 0.2, "产品开发": 0.6, "产品自测": 1, "UAT": 1, "部署上线": 0.4, "系统运维": 0.1 },
  "运维": { "需求调研": 0, "产品设计": 0.1, "产品开发": 0.1, "产品自测": 0.3, "UAT": 0.3, "部署上线": 0.5, "系统运维": 1 },
  "Agent开发": { "需求调研": 0.2, "产品设计": 0.4, "产品开发": 1, "产品自测": 0.6, "UAT": 0.6, "部署上线": 0.3, "系统运维": 0.2 },
  "UI/UX": { "需求调研": 0.3, "产品设计": 1, "产品开发": 0.7, "产品自测": 0.3, "UAT": 0.3, "部署上线": 0.1, "系统运维": 0.05 },
  "模型": { "需求调研": 0.6, "产品设计": 0.6, "产品开发": 0.9, "产品自测": 0.4, "UAT": 0.4, "部署上线": 0.2, "系统运维": 0.3 },
  "架构师": { "需求调研": 0.8, "产品设计": 0.9, "产品开发": 0.8, "产品自测": 0.3, "UAT": 0.3, "部署上线": 0.3, "系统运维": 0.1 },
  "全栈开发工程师": { "需求调研": 0.1, "产品设计": 0.3, "产品开发": 1, "产品自测": 0.6, "UAT": 0.6, "部署上线": 0.3, "系统运维": 0.2 },
};
